{
  "blogs": [{
    "author": "Matt Caswell",
    "title": "Zerg for Life!",
    "post": "<p>The Zergling Rush <br><br> Ah, the Zergling rush. Probably the most standard rush the Zerg have, not to mention the most infamous. I'll post the build order that I personally use for this rush, and it works great for me.<br><br>Drones until 10<br> 10 - Extractor (put three Drones on when it finishes)<br>9 - Drone<br> 10 - Spawning Pool<br> 9 - Overlord<br> 10 - Drone (use him to scout)<br> 11, 12 - Drones<br>13 - Zergling Speed upgrade (the Pool should finish around now, and this upgrade is CRUCIAL to the rush)<br> 13 - Queen<br>14, 15, 16 - Zerglings <br>16 - Overlord<br><br> After this, mass Zerglings until the speed upgrade finishes. When it does, set your Hatchery's rally point to just outside your opponent's ramp, and send 'em in. If your first push fails, don't worry. This is supposed to happen. During the first push, run past any units or buildings you see - go straight to his mineral line. Take out as many Probes or SCVs as you possibly can. Continue to Spawn Larva with your Queen, and just continue to make Zerglings. Somehow, the 12 Drones seems to be enough to provide an endless supply of Zerglings, so you can go on like this indefinitely. If your opponent is walled off and you can't get in at all, you have two options - cut your losses, and try to play the game out, or go for a Baneling Bust. See below. <br><br>The Baneling Bust <br><br>This is a build that incorporates Banelings to take down your opponent's wall, so your Zerglings can stream in and take out his harvesters. <br><br>9 - Overlord <br>14 - Pool <br>13 - Extractor <br>15 - Overlord <br>15 - Queen <br>17 - Zerglings <br><br>At 17, just start pumping out the Zerglings. You'll need quite a few, because a lot of them will have to morph into Banelings. With your first 100 gas, buy the Zergling speed upgrade, and with the 50 after that, throw down your Baneling Nest. After that, stockpile gas so you can morph a lot of Banelings. Once you've got about 25 Zerglings, move them to your opponent's ramp. If he walled off with a Barracks and a Factory, you'll need to morph about 10 Banelings. If walled off with a Barracks and two Supply Depots, you only need 6. Send them right at a building, and make sure the Zerglings rush in on their heels. Proceed to his mineral line first. <br><br>The Six Pool <br><br>This build is kind of cheesy, but it's a rush nonetheless. It's really simple.<br><br> 6 - Harvest until you can afford a Spawning Pool, then throw it down 5, 6, 7 - Zerglings <br><br>Move your first six Zerglings to his base and go straight for his SCVs or Probes. The idea is to get your units to his base before his unit producing buildings are even finished. If you can manage to wipe out his SCVs or Probes before he builds a unit producing structure, you win. If you can't, you'll probably lose. <br><br> Note - A lot of players tend to get disheartened if they don't win with a rush. If you take out his entire mineral line, or most of it, keep playing, because you're at a significant advantage. If he totally shuts you down, you're at a disadvantage, so you have to expand and get back to par as quickly as you can. <br><br>Economic Build Orders <br><br>These build orders are much more economically stable than the rushes, but are very open to early aggression, so scouting is EXTREMELY important. If you can pull one off, you'll almost certainly be at a large economic advantage over your opponent. <br><br>The 15 Pool <br><br>This is the build order I most commonly use. Its purpose is to put the Zerg player at an economic advantage early on. <br><br>9 - Overlord <br>10 - Drone (scout) <br>15 - Spawning Pool <br>16 - Drone (rally him to your natural expansion, and build a Hatchery when you can afford it) <br>16 - Extractor <br>17 - Hatchery (^^ this Drone) <br>17 - Overlord <br>After this, you proceed into whatever mid-game composition you need to counter your opponent. Refer to Antpile's post for information about stopping rushes.<br><br> The 14 Pool <br><br>This is IdrA's version of the 15 Pool build. I think the reason he uses it is because he likes to get Zerglings out early to scout, establish map control, and harass where he can. It's really just a matter of preference between this and the 15 Pool. <br><br>9 - Overlord <br>14 - Pool <br>15 - Hatchery <br>16 - Queen <br>16 - Extractor <br>18 - Overlord <br><br>There are more builds I could add, but already, I can tell this guide is going to be overwhelmingly long. I'll stop there, because those are the standard ones.</p>",
    "image": "https://i.ytimg.com/vi/QkGoye2H9rw/maxresdefault.jpg",
    "date": "March 22nd, 2017"
    }, {
      "author": "Kory Skarbek",
      "title": "Protoss Cannon Rush",
      "post": "A cannon rush is a protoss strategy useable against any race, but most effective against another protoss.The attacking player either builds early photon cannons outside of the enemy base or secretly builds cannons in the opponent's base early (which usually leaves the attacker open for an attack), just behind the edge of that player's sight radius. If not scouted, this tactic is very frustrating for the less experienced players to deal with. The best way of countering this rush is to scout. If the player reaches the opponent's base and sees a peculiarly small amount of structures, it's a clear indicator that a cannon rush may happen. If the initial scouting worker fails to find the opponent by about 13-14 food, the player should have another worker make a sweep around the outskirts of their base area, looking for hidden probes, pylons and possibly cannons that are about to begin building. If the player notices any of those, they should send a few workers to hunt down the probe and prevent cannons from going up or at the very least delay their progress towards the player's mineral line (by forcing the probe to make more cannons and pylons in its current position). The player should not overcommit by sending all their workers. Then, depending on what race the player is, one's options are either: Planting a defensive cannon somewhere on the way of the enemy cannons or making fast stalkers (use stalkers to snipe any cannons that begin building and stick out, fall back to recharge shields if a stalker gets hit; once you have enough stalkers, go to the enemy base and finish him off), Making two spine crawlers away from the enemy cannons and then move them to a position where they can both attack a single cannon at a time, Making a fast marauder and plant a bunker on the way of the incoming cannons. A bunkered up marauder stops the cannon rush immediately. Alternatively you can lift off and move to your natural. Be aware, however, that the opponent who has cannons in your base also has pylons there, so if one doesn't get rid of them in a sensible time frame, one might face protoss gateway units warping into one's base area in a couple of minutes.",
      "image": "https://i.ytimg.com/vi/yj7qR55HTJI/maxresdefault.jpg",
      "date": "March 19th, 2017"
      }],
  "comments": [{
        "userName": "Lil John",
        "body": "Yeah!!!!",
        "date": "4-20-17"
      }, {
        "userName": "Lil John",
        "body": "Yeah!!!!",
        "date": "4-20-17"
        }]}
